Revit 2027 API
IFCData.AsLogical Method
 Gets storage value as IFCLogical when its PrimitiveType is logical.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCLogical AsLogical()
Public Function AsLogical As IFCLogical
public:
IFCLogical AsLogical()
member AsLogical : unit -> IFCLogical
Return Value
IFCLogical
 The IFCLogical value.
Exceptions
Exception | Condition
InapplicableDataException |  The primitive type is not logical.
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace